menu_dict = {
    "밥": {
        "갈배제육": {
            "주재료": {
                ("돼지고기 앞다리살", "대파", "양파반개", "소금한꼬집")
            },
            "양념": {
                ("고추장", "간장")
            },
            "만드는법": [
                "고기 핏물 닦는다",
                "고추장에~~",
                "양념고기~~"
            ],
            "굽는법": [
                "굽는다~~ 첫번째",
                "굽는다~~ 두번째",
                "굽는다~~ 세번째"
                "굽는다~~ 세번째"
            ]
        },
        "돼지김치짜글이": {
            "주재료": {
                ("돼지고기 앞다리살", "짜글짜글", "김치", "소금한꼬집")
            },
            "양념": {
                ("고추장", "간장")
            },
            "만드는법": [
                "고기 핏물 닦는다",
                "고추장에~~",
                "양념고기~~"
            ],
            "굽는법": [
                "굽는다~~ 첫번째",
                "굽는다~~ 두번째",
                "굽는다~~ 세번째"
            ]}
    },
}

